#+TITLE: Some title
#+AUTHOR: Author 1
#+DATE: 2021:04:29
#+OPTIONS: h:6 num:t toc:nil
#+PROPERTY: header-args:matlab :session *MATLAB* :results output :exports both :eval never-export :noweb yes
#+property: header-args:julia  :session *Julia*  :exports both :eval never-export :async t
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+latex_engraved_theme: ef-light
#+LATEX_CLASS: autart
#+LATEX_CLASS_OPTIONS: [twocolumn]
#+LATEX_HEADER: \input{preamble.tex}
#+latex_header: \usepackage{float}
#+EXCLUDE_TAGS: noexport
#+LATEX: \begin{frontmatter}
#+LATEX: \title{Some title} 
#+LATEX: \author[ABCDa]{Author 1}\ead{something}
#+LATEX: \author[ABCDb]{Author 2}\ead{something}
#+LATEX: \address[ABCDa]{Some address 1}
#+LATEX: \address[ABCDb]{Some address 2}
# #+latex_class: article
# #+latex_class_options: [10pt]
#+LATEX_HEADER: \usepackage{cancel}
#+latex_header: \usepackage{mathtools}
#+BIBLIOGRAPHY: ~/Documents/roam/biblio.bib
#+EXCLUDE_TAGS: noexport ignore
#+STARTUP: showall hideblocks 

#+BEGIN_SRC julia :results silent :exports none
using Pkg; Pkg.activate(".")
#+END_SRC

The root locus method for analyzing the stability of spatially periodic PDEs.

Consider the general linear spatially periodic PDE with one spatial dimension
\begin{align}
\label{eq:general-pde-1}
\partial_t \psi(t, x) &= \mathcal{A} \psi(t, x) + \mathcal{B} u(t, x) \\
y(t, x) &= \mathcal{C} \psi(t, x)
\end{align}
where \(\mathcal{A}\) is a spatially periodic operator with period \(L \). We assume that we can write \(\mathcal{A} = \mathcal{A}_0 + p(x) \mathcal{A}_1 \), where \(p(x) \) is \(L \)-periodic and \(\mathcal{A}_0 \) and \(\mathcal{A}_1 \) are spatially invariant operators. Then we can write
\begin{align}
\label{eq:general-pde-2}
* Wave equation
Consider the wave equation with a spatially periodic wave speed and source:
\begin{equation}
\label{eq:wave-eqn-spatial-x}
\partial_{t t} \psi(t,x) = (c_0^2 + p(x)) \partial_{x x} \psi(t,x) + f(t, x)
\end{equation}
We will rewrite this as a spatially invariant system in feedback with a spatially periodic gain, then apply the lifting method.
\begin{align*}
\partial_{t t} \psi(t, x) & = c_0^2 \partial_{x x} \psi(t, x) + \underbrace{p(x) \partial_{x x} \psi(t,x)}_v + f(t,x) \\
\partial_{t t} \psi(t, x) & = c_0^2 \partial_{x x} \psi(t, x) + v(t, x) + f(t, x)
\end{align*}

#+begin_export latex
\begin{figure}
    \centering
    \def\svgwidth{0.5\columnwidth}
    \import{figures}{wave-eqn-block-diagram.pdf_tex}
    \label{fig:wave-eqn-block-diagram}
    \caption{}
\end{figure}
#+end_export

\begin{align*}
u &= G_1 f + G_2 v \\
v &= p(x) \partial_{x x} u
\end{align*}

The upper block is a spatially invariant system, so the Fourier transform converts it to a multiplication operator. The lower block is a "Toeplitz operator":
\begin{align*}
\partial_{t t} \psi(t, x) & = c_0^2 \partial_{x x} \psi(t, x) + f(t, x) & \Longleftrightarrow \partial_{t t} \hat{\psi}(t, \kappa) & = - \kappa^2 c_0^2 \hat{\psi}(t, \kappa) + f(t, \kappa)\\
v(t, x) & = p(x) \partial_{x x} \psi(t, x) = \sum_{l \in \mathbb{Z}}^{} \hat{P}_l e^{j l \bar{\kappa} x} \partial_{x x} \psi(t, x) & \Longleftrightarrow \hat{v}(t, \kappa) & = - \sum_{l \in \mathbb{Z}}^{} \hat{P}_l \left( \kappa - \bar{\kappa} l \right)^2 \hat{\psi}(t, \kappa - \bar{\kappa} l)
\end{align*}

We define the lifting of \(\hat{\psi}(t,\kappa) \) as follows:
\begin{align*}
\hat{\psi}(t, \kappa) &= \left( \begin{smallmatrix} \dots & \hat{\psi}(t, \kappa - \bar{\kappa}) & \hat{\psi}(t, \kappa) & \hat{\psi}(t, \kappa + \bar{\kappa}) &  \dots \end{smallmatrix} \right)^T
\end{align*}
and similarly for \(\hat{v} \)
Then we can define the corresponding operators
\begin{align*}
\hat{G} & = \begin{bmatrix}
& \ddots  &  & &  & \\
&  & G(\kappa - \bar{\kappa})  & & & \\
& &  & G(\kappa) & & \\
&  &  &  & G(\kappa + \bar{\kappa}) & \\
& &  &  & & \ddots
\end{bmatrix} \\
\hat{P} & = \begin{bmatrix}
\ddots & \ddots & \ddots & &  \\
 & P_{1} & P_{0} & P_{-1} & \\
& & \ddots & \ddots & \ddots 
\end{bmatrix} \begin{bmatrix}
& \ddots &  &  & & \\
& & -(\kappa - \bar{\kappa})^2 &  & & \\
& & & - (\kappa)^2 & & \\
& & & & - (\kappa + \bar{\kappa})^2 & \\
& & & & & \ddots
 \end{bmatrix}
\end{align*}
Finally, in the Laplace domain we have
\begin{align}
\label{eq:lifting-3}
\hat{\psi}(s, \kappa) &= \left( \begin{smallmatrix} \dots & \hat{\psi}(s, \kappa - \bar{\kappa}) & \hat{\psi}(s, \kappa) & \hat{\psi}(s, \kappa + \bar{\kappa}) &  \dots \end{smallmatrix} \right)^T \\
G(s,\kappa) &= \frac{1}{s^2 + \kappa^2 c_0^2}
\end{align}
and the LTI system
\begin{align}
\label{eq:lifting-4}
\hat{\psi}(s, \kappa) = \hat{G}_1(s, \kappa) \hat{F}(s, \kappa) + \hat{G}_2(s,\kappa) \hat{V}(s, \kappa)
\end{align}

#+BEGIN_SRC julia :tangle "./wave_equation/wave_equation_root_locus.jl" :mkdirp yes
  include("HPoly.jl")
  using Main.HPoly
#+END_SRC

#+BEGIN_SRC julia :tangle "./wave_equation/wave_equation_root_locus.jl" :mkdirp yes
  using LinearAlgebra
  using ControlSystems
  using Plots
  using OrdinaryDiffEq
  using Polynomials

  s = tf("s")

  nmax = 2

  # Wave equation with variable wave speed
  G_wave(l::Integer, s::TransferFunction, θ; c=1.0, Ω=0.233) = (θ + l*Ω)^2/(s^2 + c^2*(θ + l*Ω)^2)

  function H(G, nmax::Integer, s::TransferFunction, θ; kwdef...)
      g(k) = G(k,s,θ;kwdef...)
      sum(g(n)*g(n+1) for n in -nmax:1:nmax-1)
  end

  function wave_eq_poles_and_zeros_all(Ω::Float64; n=2, kwdef...)
      plt = plot()
      s = tf("s")
      g(θ, Ω) = H(G_wave, n, s, θ; Ω=Ω, c=1.0)
      for θ in range(0,Ω, length=40)
          z, p, _ = minreal(g(θ,Ω),1e-3) |> zpkdata
          # poles_and_zeros_plot!(plt, imag(z), imag(p), yoffset = θ,size=(1600,900))
          plot!(plt, (θ/Ω)*ones(length(z[1])), imag(z[1]);
                seriestype=:scatter,
                markershape=:circle,
                markersize=4,
                color=:blue, label=false, kwdef...)
          plot!(plt, (θ/Ω)*ones(length(p[1])), imag(p[1]);
                seriestype=:scatter,
                markershape=:xcross,
                markersize=4,
                color=:red, label=false, kwdef...)
      end
      plot!(plt,ylabel="-j * root location", xlabel="θ", framestyle=:origin, size=(1600,900),
            ylims=(-12,12))
      plt
  end
#+END_SRC

#+RESULTS:
: wave_eq_poles_and_zeros_all (generic function with 1 method)

#+BEGIN_SRC julia
   mov = @animate for Ω in 0:0.2:8.0
        wave_eq_poles_and_zeros_all(Ω, n=3)
    end

  gif(mov, "./wave_equation/animation_n3.gif", fps=10)
#+END_SRC

#+RESULTS:
: Plots.AnimatedGif("/home/karthik/Documents/research/driven_oscillators/periodic_pdes/wave_equation/animation_n3.gif")

#+BEGIN_SRC julia :tangle "./wave_equation/wave_equation_root_locus.jl" :results none
function compare_zeros_and_poles(;Ω=2.0,n=2)
    θ=Ω
    z, p, _ = zpkdata(H(G_wave, n, s, θ, c=1.0, Ω=Ω))
    hcat(vcat(zeros(length(p[1]) - length(z[1])), round.(imag(z[1]), digits=3)),
         round.(imag(p[1]), digits=3))
end
#+END_SRC

#+BEGIN_SRC julia :tangle "./wave_equation/wave_equation_root_locus.jl"
  compare_zeros_and_poles(n=4)
#+END_SRC

#+RESULTS:
|    0.0 |   10.0 |
|    0.0 |  -10.0 |
|    0.0 |    8.0 |
|    0.0 |   -8.0 |
|  7.084 |    6.0 |
| -7.084 |   -6.0 |
|  5.416 |  4.001 |
| -5.416 | -4.001 |
|  2.454 |    2.0 |
| -2.454 |   -2.0 |

** Eigenvalues of the periodic wave equation operator

In Fourier space, the wave equation corresponds to the family of ODEs
\begin{align*}
\partial_{t t} \psi(t, k) & = - k^2 c_0^2 \psi(t, k) - \sum\limits_n p_n (k-n \Omega)^2 \psi(t, k - n \Omega) + f(t,k)
\end{align*}
corresponding to the linear PDE operator
\begin{align*}
\mathcal{A}(k) = - k^2 c_0^2 - \sum\limits_n p_n (k - n \Omega)^2 \mathcal{S}_{n \Omega}
\end{align*}
Where \(\mathcal{S}_{\cdot} \) is the left-shift operator. Discretizing the frequency \(k \) with step \(\delta \) so that \(N \delta = \Omega \), \(\mathcal{A} \) has a matrix representation
\begin{align*}
\resizebox{0.8\hsize}{!}{$%
A \hat{\psi} = \begin{bmatrix}
  \ddots &     &                     &        &                  &                       &        &        &        \\
         &     &                     &                  & \ddots           &                       &        &        &        \\
         &     & - (c_0^2 + p_0)(-2\delta)^2 &                  &        & (-2\delta + N\delta)^2 p_{-1}                   &        &        &        \\
  \ddots &     &                     & - (c_0^2 + p_0) \delta^2 &        &                  & (-\delta + N\delta)^2 p_{-1}    &        &        \\
         & \framebox{\((-N\delta)^2 p_1\)} & \dots               & \dots            &      \framebox{0} & \dots            & \dots       & \framebox{\((N\delta)^2 p_{-1}\)} &        \\
         &     & (\delta - N\delta)^2 p_{1}                 &                  &        & - (c_0^2 + p_0) \delta^2 &                       &        & \ddots \\
         &     &                     & (2\delta - N\delta)^2 p_{1}           &        &                  & - (c_0^2 + p_0) (2 \delta)^2 &        &        \\
         &     &                     &                  & \ddots &                  &                       & \ddots &        \\
         &     &                     &                  &        &                  &                       &        & \ddots
       \end{bmatrix} \begin{pmatrix} \vdots \\ \framebox{\psi_{-N\delta}} \\ \vdots \\ \psi_{-2\delta}\\ \psi_{-\delta}\\ \framebox{\psi_{0\delta}}\\ \psi_{\delta} \\ \psi_{2\delta} \\ \vdots \\ \framebox{\psi_{N\delta}} \\ \vdots \end{pmatrix}}
\end{align*}

When \(p(x) = \epsilon \cos(\Omega x)\), \(p_{-1} = p_1 = \epsilon/2\) and \(p_n = 0 \) otherwise. Then only one super and subdiagonal of \(A \) is nonzero.

#+BEGIN_SRC julia :tangle "./wave_equation/wave_equation_eigenvalues.jl" :exports code :results silent :mkdirp yes
  using LinearAlgebra
  using SparseArrays
  using Plots

  function wave_eq_operator(ϵ::Real, Ω::Real)
      # ϵ = 0.01                        # Parametric forcing amplitude
      # Ω = 0.40                        # Parametric forcing wavenumber 
      p₊ = ϵ/2
      p₋ = ϵ/2                        # Fourier series coefficients for ϵ cos(Ω x)

      N = 16                          # number of grid points in [0, Ω]
      c₀ = 1.0                        # Wave speed
      δ = Ω/N                         # Grid spacing in frequency
      nterms = 2*N                    # Truncation of PDE operator is 2*nterms+1 square in size

      diagonal    = [ -(c₀^2 + 0) * (k*δ)^2 for k in -nterms:nterms ];
      supdiagonal = [ -(k*δ + Ω)^2 * p₋     for k in -nterms:nterms ];
      subdiagonal = [ -(k*δ - Ω)^2 * p₊     for k in -nterms:nterms ];

      Aoperator = diagm(0 => diagonal,
                        -N => subdiagonal[1+N:end],
                        N => supdiagonal[1:end-N]);
  end
#+END_SRC

#+BEGIN_SRC julia :tangle "./wave_equation/wave_equation_eigenvalues.jl" :exports code :results replace :mkdirp yes
  ϵ_all = range(0.0, 2.5, length=150)
  Ω_all = range(0.0, 1000, length=150)
  max_eigs = zeros(length(ϵ_all), length(Ω_all))
  for (i,ϵ) in enumerate(ϵ_all)
      for (j,Ω) in enumerate(Ω_all)
          max_eigs[i,j] = maximum(identity, 
                                  wave_eq_operator(ϵ, Ω) |> eigvals .|> real)
      end
  end

  # contour(Ω_all, ϵ_all, max_eigs, levels=range(0,2.0,length=20), size=(1600,900), label=false)
  size(max_eigs)
#+END_SRC

#+RESULTS:
| 150 | 150 |

#+BEGIN_SRC julia :tangle "./wave_equation/wave_equation_eigenvalues.jl" :exports both :results replace :mkdirp yes
  contour(Ω_all,ϵ_all,max_eigs,label=false, levels=exp.(-4:0.8:10), size=(1600,900),
          xlabel="Ω", ylabel="ϵ", title="Largest eigenvalue of the periodic wave equation")
#+END_SRC

#+RESULTS:
: Plot{Plots.GRBackend() n=1}

